[{"title":"OJ Ugly Number Problems","permalink":"http://taoalpha.me/blog/2016/01/25/oj-oj-ugly-number-problems/","date":"1/25/2016","summary":"263. Ugly NumberQuestionWrite a program to check whether a given number is an ugly number.\nUgly numbers are positive numbers whose prime factors only include 2, 3, 5. For example, 6, 8 are ugly while "},{"title":"High-Performance Browser Networking .1.Preface","permalink":"http://taoalpha.me/blog/2014/07/24/read-yi-high-performance-browser-networking-1-preface/","date":"7/24/2014","summary":"chrome一直以极速著称, 当然这和webkit内核有很大的关系, 但是本身chrome在网络处理上也有着非常多的优化方案, 综合了这些优化和本身优质的内核属性, chrome才能实现如今的极速~ \n进入正文前, 先介绍下原文或者说原书的作者: Ilya Grigorik.\nIlya是google的一个网络性能开发工程师, 其在很多方面都有杰出的成绩~ 有兴趣的可以去大神的github上看看大神"},{"title":"FeedPusher Pre-Alpha-Release","permalink":"http://taoalpha.me/blog/2016/01/23/tech-feedpusher-pre-release/","date":"1/23/2016","summary":"As getting close the the end of the winter break, I’m almost ready to release the alpha version of new feedpusher :).\nHere is some declaration before I release the first version :)\n\nInstead of a publi"},{"title":"OJ Sum Closest Problems","permalink":"http://taoalpha.me/blog/2016/01/21/oj-oj-sum-closest-problems/","date":"1/21/2016","summary":"16. 3Sum ClosestQuestionGiven an array S of n integers, find three integers in S such that the sum is closest to a given number, target. Return the sum of the three integers. You may assume that each "},{"title":"OJ Word Search Problems","permalink":"http://taoalpha.me/blog/2016/01/20/oj-oj-word-search-problems/","date":"1/20/2016","summary":"79. Word SearchProblemGiven a 2D board and a word, find if the word exists in the grid.\nThe word can be constructed from letters of sequentially adjacent cell, where “adjacent” cells are those horizon"},{"title":"JavaScript Sorting Algorithm - Radix Sort and Bucket Sort","permalink":"http://taoalpha.me/blog/2016/01/19/tech-javascript-sorting-algorithm-radix-sort/","date":"1/19/2016","summary":"Comparison based sorting algorithmsWe have discussed all popular comparison based sorting algorithms:insertion sort and selection sort, bubble sort and merge sort, Quicksort and Heap Sort.\nAll these a"},{"title":"Sorting Algorithm in JavaScript - Quicksort and Heap Sort","permalink":"http://taoalpha.me/blog/2016/01/19/tech-sorting-algorithm-in-javascript-median-sort-and-quicksort/","date":"1/19/2016","summary":"Last time we have finished the four different sorting algorithms including : insertion sort and selection sort, bubble sort and merge sort.\nNow let’s continue playing with another one or two.\nMedian S"},{"author":"taoalpha","title":"Sorting Algorithm in JavaScript - Insertion Sort and Selection Sort","permalink":"http://taoalpha.me/blog/2015/10/29/tech-javascript-sorting-algorithm-1/","date":"10/29/2015","summary":"Sorting AlgorithmAs the most important and fundamental algorithm, sorting algorithm is always the best start to learn algorithm.\nAmong all the different sorting algorithms, we have 10 algorithms which"},{"author":"taoalpha","title":"Sorting Algorithm in JavaScript - Bubble Sort and Merge Sort","permalink":"http://taoalpha.me/blog/2015/10/29/tech-javascript-sorting-algorithm-2/","date":"10/29/2015","summary":"IntroductionBubble sort is really cool but not so useful, it seems that you will never use it… But merge sort is really cool since it is really fast.\nBubble SortSo what is bubble sort, according to wi"},{"title":"OJ LeetCode Substring Questions 1","permalink":"http://taoalpha.me/blog/2016/01/16/oj-oj-leetcode-substring-questions-1/","date":"1/16/2016","summary":"3. Longest Substring Without Repeating CharactersQuestionGiven a string, find the length of the longest substring without repeating characters. For example, the longest substring without repeating let"},{"title":"OJ LeetCode Numbers 1","permalink":"http://taoalpha.me/blog/2016/01/16/oj-oj-leetcode-numbers-1/","date":"1/16/2016","summary":"2. Add Two NumbersQuestionYou are given two linked lists representing two non-negative numbers. The digits are stored in reverse order and each of their nodes contain a single digit. Add the two numbe"}]